/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    storage: Storage,
    align: [Align; 0],
}

impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }

    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];

        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };

        let mask = 1 << bit_index;

        byte & mask == mask
    }

    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];

        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };

        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }

    #[inline]

pub const IRQn_Type_TIM5_IRQn: IRQn_Type = 50;
/// < SPI3 global Interrupt
pub const IRQn_Type_SPI3_IRQn: IRQn_Type = 51;
/// < DMA2 Stream 0 global Interrupt
pub const IRQn_Type_DMA2_Stream0_IRQn: IRQn_Type = 56;
/// < DMA2 Stream 1 global Interrupt
pub const IRQn_Type_DMA2_Stream1_IRQn: IRQn_Type = 57;
/// < DMA2 Stream 2 global Interrupt
pub const IRQn_Type_DMA2_Stream2_IRQn: IRQn_Type = 58;
/// < DMA2 Stream 3 global Interrupt
pub const IRQn_Type_DMA2_Stream3_IRQn: IRQn_Type = 59;
/// < DMA2 Stream 4 global Interrupt
pub const IRQn_Type_DMA2_Stream4_IRQn: IRQn_Type = 60;
/// < USB OTG FS global Interrupt
pub const IRQn_Type_OTG_FS_IRQn: IRQn_Type = 67;
/// < DMA2 Stream 5 global interrupt
pub const IRQn_Type_DMA2_Stream5_IRQn: IRQn_Type = 68;
/// < DMA2 Stream 6 global interrupt
pub const IRQn_Type_DMA2_Stream6_IRQn: IRQn_Type = 69;
/// < DMA2 Stream 7 global interrupt
pub const IRQn_Type_DMA2_Stream7_IRQn: IRQn_Type = 70;
/// < USART6 global interrupt
pub const IRQn_Type_USART6_IRQn: IRQn_Type = 71;
/// < I2C3 event interrupt
pub const IRQn_Type_I2C3_EV_IRQn: IRQn_Type = 72;
/// < I2C3 error interrupt
pub const IRQn_Type_I2C3_ER_IRQn: IRQn_Type = 73;
/// < FPU global interrupt
pub const IRQn_Type_FPU_IRQn: IRQn_Type = 81;
/// < SPI4 global Interrupt
pub const IRQn_Type_SPI4_IRQn: IRQn_Type = 84;
/// @brief STM32F4XX Interrupt Number Definition, according to the selected device
/// in @ref Library_configuration_section
pub type IRQn_Type = i32;
pub type __u_char = ::ctypes::c_uchar;
pub type __u_short = ::ctypes::c_ushort;
pub type __u_int = ::ctypes::c_uint;
pub type __u_long = ::ctypes::c_ulong;
pub type __int8_t = ::ctypes::c_schar;
pub type __uint8_t = ::ctypes::c_uchar;
pub type __int16_t = ::ctypes::c_short;
pub type __uint16_t = ::ctypes::c_ushort;
pub type __int32_t = ::ctypes::c_int;
pub type __uint32_t = ::ctypes::c_uint;
pub type __int64_t = ::ctypes::c_long;
pub type __uint64_t = ::ctypes::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::ctypes::c_long;
pub type __u_quad_t = ::ctypes::c_ulong;
pub type __intmax_t = ::ctypes::c_long;
pub type __uintmax_t = ::ctypes::c_ulong;
pub type __dev_t = ::ctypes::c_ulong;
pub type __uid_t = ::ctypes::c_uint;
pub type __gid_t = ::ctypes::c_uint;
pub type __ino_t = ::ctypes::c_ulong;
pub type __ino64_t = ::ctypes::c_ulong;
pub type __mode_t = ::ctypes::c_uint;
pub type __nlink_t = ::ctypes::c_ulong;
pub type __off_t = ::ctypes::c_long;
pub type __off64_t = ::ctypes::c_long;
pub type __pid_t = ::ctypes::c_int;
#[repr(C)]
pub struct __fsid_t {
    pub __val: [::ctypes::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::ctypes::c_long;
pub type __rlim_t = ::ctypes::c_ulong;
pub type __rlim64_t = ::ctypes::c_ulong;
pub type __id_t = ::ctypes::c_uint;
pub type __time_t = ::ctypes::c_long;
pub type __useconds_t = ::ctypes::c_uint;
pub type __suseconds_t = ::ctypes::c_long;
pub type __daddr_t = ::ctypes::c_int;
pub type __key_t = ::ctypes::c_int;
pub type __clockid_t = ::ctypes::c_int;
pub type __timer_t = *mut ::ctypes::c_void;
pub type __blksize_t = ::ctypes::c_long;
pub type __blkcnt_t = ::ctypes::c_long;
pub type __blkcnt64_t = ::ctypes::c_long;
pub type __fsblkcnt_t = ::ctypes::c_ulong;
pub type __fsblkcnt64_t = ::ctypes::c_ulong;
pub type __fsfilcnt_t = ::ctypes::c_ulong;
pub type __fsfilcnt64_t = ::ctypes::c_ulong;
pub type __fsword_t = ::ctypes::c_long;
pub type __ssize_t = ::ctypes::c_long;
pub type __syscall_slong_t = ::ctypes::c_long;
pub type __syscall_ulong_t = ::ctypes::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::ctypes::c_char;
pub type __intptr_t = ::ctypes::c_long;
pub type __socklen_t = ::ctypes::c_uint;
pub type __sig_atomic_t = ::ctypes::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::ctypes::c_schar;
pub type int_fast16_t = ::ctypes::c_long;
pub type int_fast32_t = ::ctypes::c_long;
pub type int_fast64_t = ::ctypes::c_long;
pub type uint_fast8_t = ::ctypes::c_uchar;
pub type uint_fast16_t = ::ctypes::c_ulong;
pub type uint_fast32_t = ::ctypes::c_ulong;
pub type uint_fast64_t = ::ctypes::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
/// \brief  Union type to access the Application Program Status Register (APSR).
#[repr(C)]
pub struct APSR_Type {
    /// < Structure used for bit  access
    pub b: __BindgenUnionField<APSR_Type__bindgen_ty_1>,
    /// < Type      used for word access
    pub w: __BindgenUnionField<u32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
pub struct APSR_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_APSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<APSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(APSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<APSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(APSR_Type__bindgen_ty_1))
    );
}
impl APSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn GE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_GE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn Q(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Q(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        _reserved0: u32,
        GE: u32,
        _reserved1: u32,
        Q: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let GE: u32 = unsafe { ::core::mem::transmute(GE) };
            GE as u64
        });
        __bindgen_bitfield_unit.set(20usize, 7u8, {
            let _reserved1: u32 = unsafe { ::core::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let Q: u32 = unsafe { ::core::mem::transmute(Q) };
            Q as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_APSR_Type() {
    assert_eq!(
        ::core::mem::size_of::<APSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(APSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<APSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(APSR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<APSR_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(APSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<APSR_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(APSR_Type),
            "::",
            stringify!(w)
        )
    );
}
/// \brief  Union type to access the Interrupt Program Status Register (IPSR).
#[repr(C)]
pub struct IPSR_Type {
    /// < Structure used for bit  access
    pub b: __BindgenUnionField<IPSR_Type__bindgen_ty_1>,
    /// < Type      used for word access
    pub w: __BindgenUnionField<u32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
pub struct IPSR_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_IPSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<IPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(IPSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<IPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(IPSR_Type__bindgen_ty_1))
    );
}
impl IPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 23u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 23u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(ISR: u32, _reserved0: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 23u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_IPSR_Type() {
    assert_eq!(
        ::core::mem::size_of::<IPSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(IPSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<IPSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(IPSR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IPSR_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IPSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IPSR_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IPSR_Type),
            "::",
            stringify!(w)
        )
    );
}
/// \brief  Union type to access the Special-Purpose Program Status Registers (xPSR).
#[repr(C)]
pub struct xPSR_Type {
    /// < Structure used for bit  access
    pub b: __BindgenUnionField<xPSR_Type__bindgen_ty_1>,
    /// < Type      used for word access
    pub w: __BindgenUnionField<u32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
pub struct xPSR_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_xPSR_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<xPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(xPSR_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<xPSR_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(xPSR_Type__bindgen_ty_1))
    );
}
impl xPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn GE(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_GE(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn T(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_T(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn IT(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_IT(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn Q(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Q(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn V(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn C(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn N(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ISR: u32,
        _reserved0: u32,
        GE: u32,
        _reserved1: u32,
        T: u32,
        IT: u32,
        Q: u32,
        V: u32,
        C: u32,
        Z: u32,
        N: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 9u8, {
            let ISR: u32 = unsafe { ::core::mem::transmute(ISR) };
            ISR as u64
        });
        __bindgen_bitfield_unit.set(9usize, 7u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let GE: u32 = unsafe { ::core::mem::transmute(GE) };
            GE as u64
        });
        __bindgen_bitfield_unit.set(20usize, 4u8, {
            let _reserved1: u32 = unsafe { ::core::mem::transmute(_reserved1) };
            _reserved1 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let T: u32 = unsafe { ::core::mem::transmute(T) };
            T as u64
        });
        __bindgen_bitfield_unit.set(25usize, 2u8, {
            let IT: u32 = unsafe { ::core::mem::transmute(IT) };
            IT as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let Q: u32 = unsafe { ::core::mem::transmute(Q) };
            Q as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let V: u32 = unsafe { ::core::mem::transmute(V) };
            V as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let C: u32 = unsafe { ::core::mem::transmute(C) };
            C as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let Z: u32 = unsafe { ::core::mem::transmute(Z) };
            Z as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let N: u32 = unsafe { ::core::mem::transmute(N) };
            N as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_xPSR_Type() {
    assert_eq!(
        ::core::mem::size_of::<xPSR_Type>(),
        4usize,
        concat!("Size of: ", stringify!(xPSR_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<xPSR_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(xPSR_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xPSR_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xPSR_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xPSR_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xPSR_Type),
            "::",
            stringify!(w)
        )
    );
}
/// \brief  Union type to access the Control Registers (CONTROL).
#[repr(C)]
pub struct CONTROL_Type {
    /// < Structure used for bit  access
    pub b: __BindgenUnionField<CONTROL_Type__bindgen_ty_1>,
    /// < Type      used for word access
    pub w: __BindgenUnionField<u32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
pub struct CONTROL_Type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_CONTROL_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<CONTROL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(CONTROL_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<CONTROL_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(CONTROL_Type__bindgen_ty_1))
    );
}
impl CONTROL_Type__bindgen_ty_1 {
    #[inline]
    pub fn nPRIV(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nPRIV(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SPSEL(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SPSEL(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FPCA(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_FPCA(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 29u8) as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 29u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        nPRIV: u32,
        SPSEL: u32,
        FPCA: u32,
        _reserved0: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let nPRIV: u32 = unsafe { ::core::mem::transmute(nPRIV) };
            nPRIV as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let SPSEL: u32 = unsafe { ::core::mem::transmute(SPSEL) };
            SPSEL as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let FPCA: u32 = unsafe { ::core::mem::transmute(FPCA) };
            FPCA as u64
        });
        __bindgen_bitfield_unit.set(3usize, 29u8, {
            let _reserved0: u32 = unsafe { ::core::mem::transmute(_reserved0) };
            _reserved0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_CONTROL_Type() {
    assert_eq!(
        ::core::mem::size_of::<CONTROL_Type>(),
        4usize,
        concat!("Size of: ", stringify!(CONTROL_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<CONTROL_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(CONTROL_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CONTROL_Type>())).b as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CONTROL_Type),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CONTROL_Type>())).w as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CONTROL_Type),
            "::",
            stringify!(w)
        )
    );
}
/// \brief  Structure type to access the Nested Vectored Interrupt Controller (NVIC).
#[repr(C)]
pub struct NVIC_Type {
    /// < Offset: 0x000 (R/W)  Interrupt Set Enable Register
    pub ISER: [u32; 8usize],
    pub RESERVED0: [u32; 24usize],
    /// < Offset: 0x080 (R/W)  Interrupt Clear Enable Register
    pub ICER: [u32; 8usize],
    pub RSERVED1: [u32; 24usize],
    /// < Offset: 0x100 (R/W)  Interrupt Set Pending Register
    pub ISPR: [u32; 8usize],
    pub RESERVED2: [u32; 24usize],
    /// < Offset: 0x180 (R/W)  Interrupt Clear Pending Register
    pub ICPR: [u32; 8usize],
    pub RESERVED3: [u32; 24usize],
    /// < Offset: 0x200 (R/W)  Interrupt Active bit Register
    pub IABR: [u32; 8usize],
    pub RESERVED4: [u32; 56usize],
    /// < Offset: 0x300 (R/W)  Interrupt Priority Register (8Bit wide)
    pub IP: [u8; 240usize],
    pub RESERVED5: [u32; 644usize],
    /// < Offset: 0xE00 ( /W)  Software Trigger Interrupt Register
    pub STIR: u32,
}
#[test]
fn bindgen_test_layout_NVIC_Type() {
    assert_eq!(
        ::core::mem::size_of::<NVIC_Type>(),
        3588usize,
        concat!("Size of: ", stringify!(NVIC_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<NVIC_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(NVIC_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ISER as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ISER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED0 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ICER as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ICER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RSERVED1 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RSERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ISPR as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ISPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED2 as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).ICPR as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(ICPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED3 as *const _ as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).IABR as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(IABR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED4 as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).IP as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(IP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).RESERVED5 as *const _ as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<NVIC_Type>())).STIR as *const _ as usize },
        3584usize,
        concat!(
            "Offset of field: ",
            stringify!(NVIC_Type),
            "::",
            stringify!(STIR)
        )
    );
}
/// \brief  Structure type to access the System Control Block (SCB).
#[repr(C)]
pub struct SCB_Type {
    /// < Offset: 0x000 (R/ )  CPUID Base Register
    pub CPUID: u32,
    /// < Offset: 0x004 (R/W)  Interrupt Control and State Register
    pub ICSR: u32,
    /// < Offset: 0x008 (R/W)  Vector Table Offset Register
    pub VTOR: u32,
    /// < Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register
    pub AIRCR: u32,
    /// < Offset: 0x010 (R/W)  System Control Register
    pub SCR: u32,
    /// < Offset: 0x014 (R/W)  Configuration Control Register
    pub CCR: u32,
    /// < Offset: 0x018 (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15)
    pub SHP: [u8; 12usize],
    /// < Offset: 0x024 (R/W)  System Handler Control and State Register
    pub SHCSR: u32,
    /// < Offset: 0x028 (R/W)  Configurable Fault Status Register
    pub CFSR: u32,
    /// < Offset: 0x02C (R/W)  HardFault Status Register
    pub HFSR: u32,
    /// < Offset: 0x030 (R/W)  Debug Fault Status Register
    pub DFSR: u32,
    /// < Offset: 0x034 (R/W)  MemManage Fault Address Register
    pub MMFAR: u32,
    /// < Offset: 0x038 (R/W)  BusFault Address Register
    pub BFAR: u32,
    /// < Offset: 0x03C (R/W)  Auxiliary Fault Status Register
    pub AFSR: u32,
    /// < Offset: 0x040 (R/ )  Processor Feature Register
    pub PFR: [u32; 2usize],
    /// < Offset: 0x048 (R/ )  Debug Feature Register
    pub DFR: u32,
    /// < Offset: 0x04C (R/ )  Auxiliary Feature Register
    pub ADR: u32,
    /// < Offset: 0x050 (R/ )  Memory Model Feature Register
    pub MMFR: [u32; 4usize],
    /// < Offset: 0x060 (R/ )  Instruction Set Attributes Register
    pub ISAR: [u32; 5usize],
    pub RESERVED0: [u32; 5usize],
    /// < Offset: 0x088 (R/W)  Coprocessor Access Control Register
    pub CPACR: u32,
}
#[test]
fn bindgen_test_layout_SCB_Type() {
    assert_eq!(
        ::core::mem::size_of::<SCB_Type>(),
        140usize,
        concat!("Size of: ", stringify!(SCB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<SCB_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SCB_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).CPUID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CPUID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).ICSR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(ICSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).VTOR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(VTOR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).AIRCR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(AIRCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).SCR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).CCR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).SHP as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SHP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).SHCSR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(SHCSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).CFSR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CFSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).HFSR as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(HFSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).DFSR as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(DFSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).MMFAR as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(MMFAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).BFAR as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(BFAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).AFSR as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(AFSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).PFR as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(PFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).DFR as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(DFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).ADR as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(ADR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).MMFR as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(MMFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).ISAR as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(ISAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).RESERVED0 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCB_Type>())).CPACR as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(SCB_Type),
            "::",
            stringify!(CPACR)
        )
    );
}
/// \brief  Structure type to access the System Control and ID Register not in the SCB.
#[repr(C)]
pub struct SCnSCB_Type {
    pub RESERVED0: [u32; 1usize],
    /// < Offset: 0x004 (R/ )  Interrupt Controller Type Register
    pub ICTR: u32,
    /// < Offset: 0x008 (R/W)  Auxiliary Control Register
    pub ACTLR: u32,
}
#[test]
fn bindgen_test_layout_SCnSCB_Type() {
    assert_eq!(
        ::core::mem::size_of::<SCnSCB_Type>(),
        12usize,
        concat!("Size of: ", stringify!(SCnSCB_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<SCnSCB_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SCnSCB_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCnSCB_Type>())).RESERVED0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCnSCB_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCnSCB_Type>())).ICTR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SCnSCB_Type),
            "::",
            stringify!(ICTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCnSCB_Type>())).ACTLR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCnSCB_Type),
            "::",
            stringify!(ACTLR)
        )
    );
}
/// \brief  Structure type to access the System Timer (SysTick).
#[repr(C)]
pub struct SysTick_Type {
    /// < Offset: 0x000 (R/W)  SysTick Control and Status Register
    pub CTRL: u32,
    /// < Offset: 0x004 (R/W)  SysTick Reload Value Register
    pub LOAD: u32,
    /// < Offset: 0x008 (R/W)  SysTick Current Value Register
    pub VAL: u32,
    /// < Offset: 0x00C (R/ )  SysTick Calibration Register
    pub CALIB: u32,
}
#[test]
fn bindgen_test_layout_SysTick_Type() {
    assert_eq!(
        ::core::mem::size_of::<SysTick_Type>(),
        16usize,
        concat!("Size of: ", stringify!(SysTick_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<SysTick_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(SysTick_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).CTRL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).LOAD as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(LOAD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).VAL as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(VAL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SysTick_Type>())).CALIB as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SysTick_Type),
            "::",
            stringify!(CALIB)
        )
    );
}
/// \brief  Structure type to access the Instrumentation Trace Macrocell Register (ITM).
#[repr(C)]
pub struct ITM_Type {
    /// < Offset: 0x000 ( /W)  ITM Stimulus Port Registers
    pub PORT: [ITM_Type__bindgen_ty_1; 32usize],
    pub RESERVED0: [u32; 864usize],
    /// < Offset: 0xE00 (R/W)  ITM Trace Enable Register
    pub TER: u32,
    pub RESERVED1: [u32; 15usize],
    /// < Offset: 0xE40 (R/W)  ITM Trace Privilege Register
    pub TPR: u32,
    pub RESERVED2: [u32; 15usize],
    /// < Offset: 0xE80 (R/W)  ITM Trace Control Register
    pub TCR: u32,
    pub RESERVED3: [u32; 29usize],
    /// < Offset: 0xEF8 ( /W)  ITM Integration Write Register
    pub IWR: u32,
    /// < Offset: 0xEFC (R/ )  ITM Integration Read Register
    pub IRR: u32,
    /// < Offset: 0xF00 (R/W)  ITM Integration Mode Control Register
    pub IMCR: u32,
    pub RESERVED4: [u32; 43usize],
    /// < Offset: 0xFB0 ( /W)  ITM Lock Access Register
    pub LAR: u32,
    /// < Offset: 0xFB4 (R/ )  ITM Lock Status Register
    pub LSR: u32,
    pub RESERVED5: [u32; 6usize],
    /// < Offset: 0xFD0 (R/ )  ITM Peripheral Identification Register #4
    pub PID4: u32,
    /// < Offset: 0xFD4 (R/ )  ITM Peripheral Identification Register #5
    pub PID5: u32,
    /// < Offset: 0xFD8 (R/ )  ITM Peripheral Identification Register #6
    pub PID6: u32,
    /// < Offset: 0xFDC (R/ )  ITM Peripheral Identification Register #7
    pub PID7: u32,
    /// < Offset: 0xFE0 (R/ )  ITM Peripheral Identification Register #0
    pub PID0: u32,
    /// < Offset: 0xFE4 (R/ )  ITM Peripheral Identification Register #1
    pub PID1: u32,
    /// < Offset: 0xFE8 (R/ )  ITM Peripheral Identification Register #2
    pub PID2: u32,
    /// < Offset: 0xFEC (R/ )  ITM Peripheral Identification Register #3
    pub PID3: u32,
    /// < Offset: 0xFF0 (R/ )  ITM Component  Identification Register #0
    pub CID0: u32,
    /// < Offset: 0xFF4 (R/ )  ITM Component  Identification Register #1
    pub CID1: u32,
    /// < Offset: 0xFF8 (R/ )  ITM Component  Identification Register #2
    pub CID2: u32,
    /// < Offset: 0xFFC (R/ )  ITM Component  Identification Register #3
    pub CID3: u32,
}
#[repr(C)]
pub struct ITM_Type__bindgen_ty_1 {
    /// < Offset: 0x000 ( /W)  ITM Stimulus Port 8-bit
    pub u8: __BindgenUnionField<u8>,
    /// < Offset: 0x000 ( /W)  ITM Stimulus Port 16-bit
    pub u16: __BindgenUnionField<u16>,
    /// < Offset: 0x000 ( /W)  ITM Stimulus Port 32-bit
    pub u32: __BindgenUnionField<u32>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_ITM_Type__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ITM_Type__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(ITM_Type__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ITM_Type__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ITM_Type__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type__bindgen_ty_1>())).u8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type__bindgen_ty_1),
            "::",
            stringify!(u8)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type__bindgen_ty_1>())).u16 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type__bindgen_ty_1),
            "::",
            stringify!(u16)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type__bindgen_ty_1>())).u32 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type__bindgen_ty_1),
            "::",
            stringify!(u32)
        )
    );
}
#[test]
fn bindgen_test_layout_ITM_Type() {
    assert_eq!(
        ::core::mem::size_of::<ITM_Type>(),
        4096usize,
        concat!("Size of: ", stringify!(ITM_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<ITM_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(ITM_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PORT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PORT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED0 as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).TER as *const _ as usize },
        3584usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(TER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED1 as *const _ as usize },
        3588usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).TPR as *const _ as usize },
        3648usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(TPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED2 as *const _ as usize },
        3652usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).TCR as *const _ as usize },
        3712usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(TCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED3 as *const _ as usize },
        3716usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).IWR as *const _ as usize },
        3832usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(IWR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).IRR as *const _ as usize },
        3836usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(IRR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).IMCR as *const _ as usize },
        3840usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(IMCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED4 as *const _ as usize },
        3844usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).LAR as *const _ as usize },
        4016usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(LAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).LSR as *const _ as usize },
        4020usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(LSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).RESERVED5 as *const _ as usize },
        4024usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID4 as *const _ as usize },
        4048usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID5 as *const _ as usize },
        4052usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID6 as *const _ as usize },
        4056usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID7 as *const _ as usize },
        4060usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID0 as *const _ as usize },
        4064usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID1 as *const _ as usize },
        4068usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID2 as *const _ as usize },
        4072usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).PID3 as *const _ as usize },
        4076usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(PID3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).CID0 as *const _ as usize },
        4080usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).CID1 as *const _ as usize },
        4084usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).CID2 as *const _ as usize },
        4088usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ITM_Type>())).CID3 as *const _ as usize },
        4092usize,
        concat!(
            "Offset of field: ",
            stringify!(ITM_Type),
            "::",
            stringify!(CID3)
        )
    );
}
/// \brief  Structure type to access the Data Watchpoint and Trace Register (DWT).
#[repr(C)]
pub struct DWT_Type {
    /// < Offset: 0x000 (R/W)  Control Register
    pub CTRL: u32,
    /// < Offset: 0x004 (R/W)  Cycle Count Register
    pub CYCCNT: u32,
    /// < Offset: 0x008 (R/W)  CPI Count Register
    pub CPICNT: u32,
    /// < Offset: 0x00C (R/W)  Exception Overhead Count Register
    pub EXCCNT: u32,
    /// < Offset: 0x010 (R/W)  Sleep Count Register
    pub SLEEPCNT: u32,
    /// < Offset: 0x014 (R/W)  LSU Count Register
    pub LSUCNT: u32,
    /// < Offset: 0x018 (R/W)  Folded-instruction Count Register
    pub FOLDCNT: u32,
    /// < Offset: 0x01C (R/ )  Program Counter Sample Register
    pub PCSR: u32,
    /// < Offset: 0x020 (R/W)  Comparator Register 0
    pub COMP0: u32,
    /// < Offset: 0x024 (R/W)  Mask Register 0
    pub MASK0: u32,
    /// < Offset: 0x028 (R/W)  Function Register 0
    pub FUNCTION0: u32,
    pub RESERVED0: [u32; 1usize],
    /// < Offset: 0x030 (R/W)  Comparator Register 1
    pub COMP1: u32,
    /// < Offset: 0x034 (R/W)  Mask Register 1
    pub MASK1: u32,
    /// < Offset: 0x038 (R/W)  Function Register 1
    pub FUNCTION1: u32,
    pub RESERVED1: [u32; 1usize],
    /// < Offset: 0x040 (R/W)  Comparator Register 2
    pub COMP2: u32,
    /// < Offset: 0x044 (R/W)  Mask Register 2
    pub MASK2: u32,
    /// < Offset: 0x048 (R/W)  Function Register 2
    pub FUNCTION2: u32,
    pub RESERVED2: [u32; 1usize],
    /// < Offset: 0x050 (R/W)  Comparator Register 3
    pub COMP3: u32,
    /// < Offset: 0x054 (R/W)  Mask Register 3
    pub MASK3: u32,
    /// < Offset: 0x058 (R/W)  Function Register 3
    pub FUNCTION3: u32,
}
#[test]
fn bindgen_test_layout_DWT_Type() {
    assert_eq!(
        ::core::mem::size_of::<DWT_Type>(),
        92usize,
        concat!("Size of: ", stringify!(DWT_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<DWT_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(DWT_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).CTRL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).CYCCNT as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(CYCCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).CPICNT as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(CPICNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).EXCCNT as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(EXCCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).SLEEPCNT as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(SLEEPCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).LSUCNT as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(LSUCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).FOLDCNT as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FOLDCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).PCSR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(PCSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).COMP0 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).MASK0 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).FUNCTION0 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).RESERVED0 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).COMP1 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).MASK1 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).FUNCTION1 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).RESERVED1 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).COMP2 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).MASK2 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).FUNCTION2 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).RESERVED2 as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).COMP3 as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(COMP3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).MASK3 as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(MASK3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DWT_Type>())).FUNCTION3 as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(DWT_Type),
            "::",
            stringify!(FUNCTION3)
        )
    );
}
/// \brief  Structure type to access the Trace Port Interface Register (TPI).
#[repr(C)]
pub struct TPI_Type {
    /// < Offset: 0x000 (R/ )  Supported Parallel Port Size Register
    pub SSPSR: u32,
    /// < Offset: 0x004 (R/W)  Current Parallel Port Size Register
    pub CSPSR: u32,
    pub RESERVED0: [u32; 2usize],
    /// < Offset: 0x010 (R/W)  Asynchronous Clock Prescaler Register
    pub ACPR: u32,
    pub RESERVED1: [u32; 55usize],
    /// < Offset: 0x0F0 (R/W)  Selected Pin Protocol Register
    pub SPPR: u32,
    pub RESERVED2: [u32; 131usize],
    /// < Offset: 0x300 (R/ )  Formatter and Flush Status Register
    pub FFSR: u32,
    /// < Offset: 0x304 (R/W)  Formatter and Flush Control Register
    pub FFCR: u32,
    /// < Offset: 0x308 (R/ )  Formatter Synchronization Counter Register
    pub FSCR: u32,
    pub RESERVED3: [u32; 759usize],
    /// < Offset: 0xEE8 (R/ )  TRIGGER
    pub TRIGGER: u32,
    /// < Offset: 0xEEC (R/ )  Integration ETM Data
    pub FIFO0: u32,
    /// < Offset: 0xEF0 (R/ )  ITATBCTR2
    pub ITATBCTR2: u32,
    pub RESERVED4: [u32; 1usize],
    /// < Offset: 0xEF8 (R/ )  ITATBCTR0
    pub ITATBCTR0: u32,
    /// < Offset: 0xEFC (R/ )  Integration ITM Data
    pub FIFO1: u32,
    /// < Offset: 0xF00 (R/W)  Integration Mode Control
    pub ITCTRL: u32,
    pub RESERVED5: [u32; 39usize],
    /// < Offset: 0xFA0 (R/W)  Claim tag set
    pub CLAIMSET: u32,
    /// < Offset: 0xFA4 (R/W)  Claim tag clear
    pub CLAIMCLR: u32,
    pub RESERVED7: [u32; 8usize],
    /// < Offset: 0xFC8 (R/ )  TPIU_DEVID
    pub DEVID: u32,
    /// < Offset: 0xFCC (R/ )  TPIU_DEVTYPE
    pub DEVTYPE: u32,
}
#[test]
fn bindgen_test_layout_TPI_Type() {
    assert_eq!(
        ::core::mem::size_of::<TPI_Type>(),
        4048usize,
        concat!("Size of: ", stringify!(TPI_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<TPI_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(TPI_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).SSPSR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(SSPSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).CSPSR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(CSPSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED0 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).ACPR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ACPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).SPPR as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(SPPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED2 as *const _ as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).FFSR as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FFSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).FFCR as *const _ as usize },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FFCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).FSCR as *const _ as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FSCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED3 as *const _ as usize },
        780usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).TRIGGER as *const _ as usize },
        3816usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(TRIGGER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).FIFO0 as *const _ as usize },
        3820usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FIFO0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).ITATBCTR2 as *const _ as usize },
        3824usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ITATBCTR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED4 as *const _ as usize },
        3828usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).ITATBCTR0 as *const _ as usize },
        3832usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ITATBCTR0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).FIFO1 as *const _ as usize },
        3836usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(FIFO1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).ITCTRL as *const _ as usize },
        3840usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(ITCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED5 as *const _ as usize },
        3844usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).CLAIMSET as *const _ as usize },
        4000usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(CLAIMSET)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).CLAIMCLR as *const _ as usize },
        4004usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(CLAIMCLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).RESERVED7 as *const _ as usize },
        4008usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(RESERVED7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).DEVID as *const _ as usize },
        4040usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(DEVID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TPI_Type>())).DEVTYPE as *const _ as usize },
        4044usize,
        concat!(
            "Offset of field: ",
            stringify!(TPI_Type),
            "::",
            stringify!(DEVTYPE)
        )
    );
}
/// \brief  Structure type to access the Memory Protection Unit (MPU).
#[repr(C)]
pub struct MPU_Type {
    /// < Offset: 0x000 (R/ )  MPU Type Register
    pub TYPE: u32,
    /// < Offset: 0x004 (R/W)  MPU Control Register
    pub CTRL: u32,
    /// < Offset: 0x008 (R/W)  MPU Region RNRber Register
    pub RNR: u32,
    /// < Offset: 0x00C (R/W)  MPU Region Base Address Register
    pub RBAR: u32,
    /// < Offset: 0x010 (R/W)  MPU Region Attribute and Size Register
    pub RASR: u32,
    /// < Offset: 0x014 (R/W)  MPU Alias 1 Region Base Address Register
    pub RBAR_A1: u32,
    /// < Offset: 0x018 (R/W)  MPU Alias 1 Region Attribute and Size Register
    pub RASR_A1: u32,
    /// < Offset: 0x01C (R/W)  MPU Alias 2 Region Base Address Register
    pub RBAR_A2: u32,
    /// < Offset: 0x020 (R/W)  MPU Alias 2 Region Attribute and Size Register
    pub RASR_A2: u32,
    /// < Offset: 0x024 (R/W)  MPU Alias 3 Region Base Address Register
    pub RBAR_A3: u32,
    /// < Offset: 0x028 (R/W)  MPU Alias 3 Region Attribute and Size Register
    pub RASR_A3: u32,
}
#[test]
fn bindgen_test_layout_MPU_Type() {
    assert_eq!(
        ::core::mem::size_of::<MPU_Type>(),
        44usize,
        concat!("Size of: ", stringify!(MPU_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<MPU_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(MPU_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).TYPE as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(TYPE)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).CTRL as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(CTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RNR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RNR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RBAR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RBAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RASR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RASR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RBAR_A1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RBAR_A1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RASR_A1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RASR_A1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RBAR_A2 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RBAR_A2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RASR_A2 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RASR_A2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RBAR_A3 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RBAR_A3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPU_Type>())).RASR_A3 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MPU_Type),
            "::",
            stringify!(RASR_A3)
        )
    );
}
/// \brief  Structure type to access the Floating Point Unit (FPU).
#[repr(C)]
pub struct FPU_Type {
    pub RESERVED0: [u32; 1usize],
    /// < Offset: 0x004 (R/W)  Floating-Point Context Control Register
    pub FPCCR: u32,
    /// < Offset: 0x008 (R/W)  Floating-Point Context Address Register
    pub FPCAR: u32,
    /// < Offset: 0x00C (R/W)  Floating-Point Default Status Control Register
    pub FPDSCR: u32,
    /// < Offset: 0x010 (R/ )  Media and FP Feature Register 0
    pub MVFR0: u32,
    /// < Offset: 0x014 (R/ )  Media and FP Feature Register 1
    pub MVFR1: u32,
}
#[test]
fn bindgen_test_layout_FPU_Type() {
    assert_eq!(
        ::core::mem::size_of::<FPU_Type>(),
        24usize,
        concat!("Size of: ", stringify!(FPU_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<FPU_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(FPU_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).RESERVED0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).FPCCR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(FPCCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).FPCAR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(FPCAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).FPDSCR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(FPDSCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).MVFR0 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(MVFR0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FPU_Type>())).MVFR1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FPU_Type),
            "::",
            stringify!(MVFR1)
        )
    );
}
/// \brief  Structure type to access the Core Debug Register (CoreDebug).
#[repr(C)]
pub struct CoreDebug_Type {
    /// < Offset: 0x000 (R/W)  Debug Halting Control and Status Register
    pub DHCSR: u32,
    /// < Offset: 0x004 ( /W)  Debug Core Register Selector Register
    pub DCRSR: u32,
    /// < Offset: 0x008 (R/W)  Debug Core Register Data Register
    pub DCRDR: u32,
    /// < Offset: 0x00C (R/W)  Debug Exception and Monitor Control Register
    pub DEMCR: u32,
}
#[test]
fn bindgen_test_layout_CoreDebug_Type() {
    assert_eq!(
        ::core::mem::size_of::<CoreDebug_Type>(),
        16usize,
        concat!("Size of: ", stringify!(CoreDebug_Type))
    );
    assert_eq!(
        ::core::mem::align_of::<CoreDebug_Type>(),
        4usize,
        concat!("Alignment of ", stringify!(CoreDebug_Type))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CoreDebug_Type>())).DHCSR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DHCSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CoreDebug_Type>())).DCRSR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DCRSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CoreDebug_Type>())).DCRDR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DCRDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CoreDebug_Type>())).DEMCR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CoreDebug_Type),
            "::",
            stringify!(DEMCR)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}ITM_RxBuffer"]
    pub static mut ITM_RxBuffer: i32;
}
extern "C" {
    #[link_name = "\u{1}SystemCoreClock"]
    pub static mut SystemCoreClock: u32;
}
extern "C" {
    #[link_name = "\u{1}AHBPrescTable"]
    pub static mut AHBPrescTable: [u8; 16usize];
}
extern "C" {
    #[link_name = "\u{1}APBPrescTable"]
    pub static mut APBPrescTable: [u8; 8usize];
}
extern "C" {
    /// @addtogroup STM32F4xx_System_Exported_Functions
    /// @{
    pub fn SystemInit();
}
extern "C" {
    pub fn SystemCoreClockUpdate();
}
/// @brief Analog to Digital Converter
#[repr(C)]
pub struct ADC_TypeDef {
    /// < ADC status register,                         Address offset: 0x00
    pub SR: u32,
    /// < ADC control register 1,                      Address offset: 0x04
    pub CR1: u32,
    /// < ADC control register 2,                      Address offset: 0x08
    pub CR2: u32,
    /// < ADC sample time register 1,                  Address offset: 0x0C
    pub SMPR1: u32,
    /// < ADC sample time register 2,                  Address offset: 0x10
    pub SMPR2: u32,
    /// < ADC injected channel data offset register 1, Address offset: 0x14
    pub JOFR1: u32,
    /// < ADC injected channel data offset register 2, Address offset: 0x18
    pub JOFR2: u32,
    /// < ADC injected channel data offset register 3, Address offset: 0x1C
    pub JOFR3: u32,
    /// < ADC injected channel data offset register 4, Address offset: 0x20
    pub JOFR4: u32,
    /// < ADC watchdog higher threshold register,      Address offset: 0x24
    pub HTR: u32,
    /// < ADC watchdog lower threshold register,       Address offset: 0x28
    pub LTR: u32,
    /// < ADC regular sequence register 1,             Address offset: 0x2C
    pub SQR1: u32,
    /// < ADC regular sequence register 2,             Address offset: 0x30
    pub SQR2: u32,
    /// < ADC regular sequence register 3,             Address offset: 0x34
    pub SQR3: u32,
    /// < ADC injected sequence register,              Address offset: 0x38
    pub JSQR: u32,
    /// < ADC injected data register 1,                Address offset: 0x3C
    pub JDR1: u32,
    /// < ADC injected data register 2,                Address offset: 0x40
    pub JDR2: u32,
    /// < ADC injected data register 3,                Address offset: 0x44
    pub JDR3: u32,
    /// < ADC injected data register 4,                Address offset: 0x48
    pub JDR4: u32,
    /// < ADC regular data register,                   Address offset: 0x4C
    pub DR: u32,
}
#[test]
fn bindgen_test_layout_ADC_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<ADC_TypeDef>(),
        80usize,
        concat!("Size of: ", stringify!(ADC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).CR1 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).CR2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SMPR1 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SMPR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SMPR2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SMPR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JOFR1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JOFR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JOFR2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JOFR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JOFR3 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JOFR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JOFR4 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JOFR4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).HTR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(HTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).LTR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(LTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SQR1 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SQR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SQR2 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SQR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).SQR3 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(SQR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JSQR as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JSQR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JDR1 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JDR2 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JDR3 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).JDR4 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(JDR4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_TypeDef>())).DR as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_TypeDef),
            "::",
            stringify!(DR)
        )
    );
}
#[repr(C)]
pub struct ADC_Common_TypeDef {
    /// < ADC Common status register,                  Address offset: ADC1 base address + 0x300
    pub CSR: u32,
    /// < ADC common control register,                 Address offset: ADC1 base address + 0x304
    pub CCR: u32,
    /// < ADC common regular data register for dual
    /// AND triple modes,                            Address offset: ADC1 base address + 0x308
    pub CDR: u32,
}
#[test]
fn bindgen_test_layout_ADC_Common_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<ADC_Common_TypeDef>(),
        12usize,
        concat!("Size of: ", stringify!(ADC_Common_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<ADC_Common_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(ADC_Common_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_Common_TypeDef>())).CSR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Common_TypeDef),
            "::",
            stringify!(CSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_Common_TypeDef>())).CCR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Common_TypeDef),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ADC_Common_TypeDef>())).CDR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ADC_Common_TypeDef),
            "::",
            stringify!(CDR)
        )
    );
}
/// @brief CRC calculation unit
#[repr(C)]
pub struct CRC_TypeDef {
    /// < CRC Data register,             Address offset: 0x00
    pub DR: u32,
    /// < CRC Independent data register, Address offset: 0x04
    pub IDR: u8,
    /// < Reserved, 0x05
    pub RESERVED0: u8,
    /// < Reserved, 0x06
    pub RESERVED1: u16,
    /// < CRC Control register,          Address offset: 0x08
    pub CR: u32,
}
#[test]
fn bindgen_test_layout_CRC_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<CRC_TypeDef>(),
        12usize,
        concat!("Size of: ", stringify!(CRC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<CRC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(CRC_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).DR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).IDR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(IDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).RESERVED0 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).RESERVED1 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<CRC_TypeDef>())).CR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CRC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
}
/// @brief Debug MCU
#[repr(C)]
pub struct DBGMCU_TypeDef {
    /// < MCU device ID code,               Address offset: 0x00
    pub IDCODE: u32,
    /// < Debug MCU configuration register, Address offset: 0x04
    pub CR: u32,
    /// < Debug MCU APB1 freeze register,   Address offset: 0x08
    pub APB1FZ: u32,
    /// < Debug MCU APB2 freeze register,   Address offset: 0x0C
    pub APB2FZ: u32,
}
#[test]
fn bindgen_test_layout_DBGMCU_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<DBGMCU_TypeDef>(),
        16usize,
        concat!("Size of: ", stringify!(DBGMCU_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DBGMCU_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DBGMCU_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DBGMCU_TypeDef>())).IDCODE as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DBGMCU_TypeDef),
            "::",
            stringify!(IDCODE)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DBGMCU_TypeDef>())).CR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DBGMCU_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DBGMCU_TypeDef>())).APB1FZ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DBGMCU_TypeDef),
            "::",
            stringify!(APB1FZ)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DBGMCU_TypeDef>())).APB2FZ as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DBGMCU_TypeDef),
            "::",
            stringify!(APB2FZ)
        )
    );
}
/// @brief DMA Controller
#[repr(C)]
pub struct DMA_Stream_TypeDef {
    /// < DMA stream x configuration register
    pub CR: u32,
    /// < DMA stream x number of data register
    pub NDTR: u32,
    /// < DMA stream x peripheral address register
    pub PAR: u32,
    /// < DMA stream x memory 0 address register
    pub M0AR: u32,
    /// < DMA stream x memory 1 address register
    pub M1AR: u32,
    /// < DMA stream x FIFO control register
    pub FCR: u32,
}
#[test]
fn bindgen_test_layout_DMA_Stream_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<DMA_Stream_TypeDef>(),
        24usize,
        concat!("Size of: ", stringify!(DMA_Stream_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DMA_Stream_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DMA_Stream_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_Stream_TypeDef>())).CR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Stream_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_Stream_TypeDef>())).NDTR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Stream_TypeDef),
            "::",
            stringify!(NDTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_Stream_TypeDef>())).PAR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Stream_TypeDef),
            "::",
            stringify!(PAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_Stream_TypeDef>())).M0AR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Stream_TypeDef),
            "::",
            stringify!(M0AR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_Stream_TypeDef>())).M1AR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Stream_TypeDef),
            "::",
            stringify!(M1AR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_Stream_TypeDef>())).FCR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_Stream_TypeDef),
            "::",
            stringify!(FCR)
        )
    );
}
#[repr(C)]
pub struct DMA_TypeDef {
    /// < DMA low interrupt status register,      Address offset: 0x00
    pub LISR: u32,
    /// < DMA high interrupt status register,     Address offset: 0x04
    pub HISR: u32,
    /// < DMA low interrupt flag clear register,  Address offset: 0x08
    pub LIFCR: u32,
    /// < DMA high interrupt flag clear register, Address offset: 0x0C
    pub HIFCR: u32,
}
#[test]
fn bindgen_test_layout_DMA_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<DMA_TypeDef>(),
        16usize,
        concat!("Size of: ", stringify!(DMA_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<DMA_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(DMA_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_TypeDef>())).LISR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_TypeDef),
            "::",
            stringify!(LISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_TypeDef>())).HISR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_TypeDef),
            "::",
            stringify!(HISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_TypeDef>())).LIFCR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_TypeDef),
            "::",
            stringify!(LIFCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<DMA_TypeDef>())).HIFCR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DMA_TypeDef),
            "::",
            stringify!(HIFCR)
        )
    );
}
/// @brief External Interrupt/Event Controller
#[repr(C)]
pub struct EXTI_TypeDef {
    /// < EXTI Interrupt mask register,            Address offset: 0x00
    pub IMR: u32,
    /// < EXTI Event mask register,                Address offset: 0x04
    pub EMR: u32,
    /// < EXTI Rising trigger selection register,  Address offset: 0x08
    pub RTSR: u32,
    /// < EXTI Falling trigger selection register, Address offset: 0x0C
    pub FTSR: u32,
    /// < EXTI Software interrupt event register,  Address offset: 0x10
    pub SWIER: u32,
    /// < EXTI Pending register,                   Address offset: 0x14
    pub PR: u32,
}
#[test]
fn bindgen_test_layout_EXTI_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<EXTI_TypeDef>(),
        24usize,
        concat!("Size of: ", stringify!(EXTI_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<EXTI_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(EXTI_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).IMR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(IMR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).EMR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(EMR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).RTSR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(RTSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).FTSR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(FTSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).SWIER as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(SWIER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<EXTI_TypeDef>())).PR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(EXTI_TypeDef),
            "::",
            stringify!(PR)
        )
    );
}
/// @brief FLASH Registers
#[repr(C)]
pub struct FLASH_TypeDef {
    /// < FLASH access control register,   Address offset: 0x00
    pub ACR: u32,
    /// < FLASH key register,              Address offset: 0x04
    pub KEYR: u32,
    /// < FLASH option key register,       Address offset: 0x08
    pub OPTKEYR: u32,
    /// < FLASH status register,           Address offset: 0x0C
    pub SR: u32,
    /// < FLASH control register,          Address offset: 0x10
    pub CR: u32,
    /// < FLASH option control register ,  Address offset: 0x14
    pub OPTCR: u32,
    /// < FLASH option control register 1, Address offset: 0x18
    pub OPTCR1: u32,
}
#[test]
fn bindgen_test_layout_FLASH_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<FLASH_TypeDef>(),
        28usize,
        concat!("Size of: ", stringify!(FLASH_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<FLASH_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(FLASH_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).ACR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(ACR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).KEYR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(KEYR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).OPTKEYR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(OPTKEYR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).SR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).CR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).OPTCR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(OPTCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FLASH_TypeDef>())).OPTCR1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FLASH_TypeDef),
            "::",
            stringify!(OPTCR1)
        )
    );
}
/// @brief General Purpose I/O
#[repr(C)]
pub struct GPIO_TypeDef {
    /// < GPIO port mode register,               Address offset: 0x00
    pub MODER: u32,
    /// < GPIO port output type register,        Address offset: 0x04
    pub OTYPER: u32,
    /// < GPIO port output speed register,       Address offset: 0x08
    pub OSPEEDR: u32,
    /// < GPIO port pull-up/pull-down register,  Address offset: 0x0C
    pub PUPDR: u32,
    /// < GPIO port input data register,         Address offset: 0x10
    pub IDR: u32,
    /// < GPIO port output data register,        Address offset: 0x14
    pub ODR: u32,
    /// < GPIO port bit set/reset register,      Address offset: 0x18
    pub BSRR: u32,
    /// < GPIO port configuration lock register, Address offset: 0x1C
    pub LCKR: u32,
    /// < GPIO alternate function registers,     Address offset: 0x20-0x24
    pub AFR: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_GPIO_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<GPIO_TypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(GPIO_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<GPIO_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(GPIO_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).MODER as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(MODER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).OTYPER as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(OTYPER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).OSPEEDR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(OSPEEDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).PUPDR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(PUPDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).IDR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(IDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).ODR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(ODR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).BSRR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(BSRR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).LCKR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(LCKR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GPIO_TypeDef>())).AFR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GPIO_TypeDef),
            "::",
            stringify!(AFR)
        )
    );
}
/// @brief System configuration controller
#[repr(C)]
pub struct SYSCFG_TypeDef {
    /// < SYSCFG memory remap register,                      Address offset: 0x00
    pub MEMRMP: u32,
    /// < SYSCFG peripheral mode configuration register,     Address offset: 0x04
    pub PMC: u32,
    /// < SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14
    pub EXTICR: [u32; 4usize],
    /// < Reserved, 0x18-0x1C
    pub RESERVED: [u32; 2usize],
    /// < SYSCFG Compensation cell control register,         Address offset: 0x20
    pub CMPCR: u32,
}
#[test]
fn bindgen_test_layout_SYSCFG_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<SYSCFG_TypeDef>(),
        36usize,
        concat!("Size of: ", stringify!(SYSCFG_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<SYSCFG_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(SYSCFG_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).MEMRMP as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(MEMRMP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).PMC as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(PMC)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).EXTICR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(EXTICR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).RESERVED as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(RESERVED)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SYSCFG_TypeDef>())).CMPCR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SYSCFG_TypeDef),
            "::",
            stringify!(CMPCR)
        )
    );
}
/// @brief Inter-integrated Circuit Interface
#[repr(C)]
pub struct I2C_TypeDef {
    /// < I2C Control register 1,     Address offset: 0x00
    pub CR1: u32,
    /// < I2C Control register 2,     Address offset: 0x04
    pub CR2: u32,
    /// < I2C Own address register 1, Address offset: 0x08
    pub OAR1: u32,
    /// < I2C Own address register 2, Address offset: 0x0C
    pub OAR2: u32,
    /// < I2C Data register,          Address offset: 0x10
    pub DR: u32,
    /// < I2C Status register 1,      Address offset: 0x14
    pub SR1: u32,
    /// < I2C Status register 2,      Address offset: 0x18
    pub SR2: u32,
    /// < I2C Clock control register, Address offset: 0x1C
    pub CCR: u32,
    /// < I2C TRISE register,         Address offset: 0x20
    pub TRISE: u32,
    /// < I2C FLTR register,          Address offset: 0x24
    pub FLTR: u32,
}
#[test]
fn bindgen_test_layout_I2C_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<I2C_TypeDef>(),
        40usize,
        concat!("Size of: ", stringify!(I2C_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<I2C_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(I2C_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).CR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).CR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).OAR1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(OAR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).OAR2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(OAR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).DR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).SR1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(SR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).SR2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(SR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).CCR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(CCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).TRISE as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(TRISE)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<I2C_TypeDef>())).FLTR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(I2C_TypeDef),
            "::",
            stringify!(FLTR)
        )
    );
}
/// @brief Independent WATCHDOG
#[repr(C)]
pub struct IWDG_TypeDef {
    /// < IWDG Key register,       Address offset: 0x00
    pub KR: u32,
    /// < IWDG Prescaler register, Address offset: 0x04
    pub PR: u32,
    /// < IWDG Reload register,    Address offset: 0x08
    pub RLR: u32,
    /// < IWDG Status register,    Address offset: 0x0C
    pub SR: u32,
}
#[test]
fn bindgen_test_layout_IWDG_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<IWDG_TypeDef>(),
        16usize,
        concat!("Size of: ", stringify!(IWDG_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<IWDG_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(IWDG_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IWDG_TypeDef>())).KR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(KR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IWDG_TypeDef>())).PR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(PR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IWDG_TypeDef>())).RLR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(RLR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IWDG_TypeDef>())).SR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(IWDG_TypeDef),
            "::",
            stringify!(SR)
        )
    );
}
/// @brief Power Control
#[repr(C)]
pub struct PWR_TypeDef {
    /// < PWR power control register,        Address offset: 0x00
    pub CR: u32,
    /// < PWR power control/status register, Address offset: 0x04
    pub CSR: u32,
}
#[test]
fn bindgen_test_layout_PWR_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<PWR_TypeDef>(),
        8usize,
        concat!("Size of: ", stringify!(PWR_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<PWR_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(PWR_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).CR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<PWR_TypeDef>())).CSR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PWR_TypeDef),
            "::",
            stringify!(CSR)
        )
    );
}
/// @brief Reset and Clock Control
#[repr(C)]
pub struct RCC_TypeDef {
    /// < RCC clock control register,                                  Address offset: 0x00
    pub CR: u32,
    /// < RCC PLL configuration register,                              Address offset: 0x04
    pub PLLCFGR: u32,
    /// < RCC clock configuration register,                            Address offset: 0x08
    pub CFGR: u32,
    /// < RCC clock interrupt register,                                Address offset: 0x0C
    pub CIR: u32,
    /// < RCC AHB1 peripheral reset register,                          Address offset: 0x10
    pub AHB1RSTR: u32,
    /// < RCC AHB2 peripheral reset register,                          Address offset: 0x14
    pub AHB2RSTR: u32,
    /// < RCC AHB3 peripheral reset register,                          Address offset: 0x18
    pub AHB3RSTR: u32,
    /// < Reserved, 0x1C
    pub RESERVED0: u32,
    /// < RCC APB1 peripheral reset register,                          Address offset: 0x20
    pub APB1RSTR: u32,
    /// < RCC APB2 peripheral reset register,                          Address offset: 0x24
    pub APB2RSTR: u32,
    /// < Reserved, 0x28-0x2C
    pub RESERVED1: [u32; 2usize],
    /// < RCC AHB1 peripheral clock register,                          Address offset: 0x30
    pub AHB1ENR: u32,
    /// < RCC AHB2 peripheral clock register,                          Address offset: 0x34
    pub AHB2ENR: u32,
    /// < RCC AHB3 peripheral clock register,                          Address offset: 0x38
    pub AHB3ENR: u32,
    /// < Reserved, 0x3C
    pub RESERVED2: u32,
    /// < RCC APB1 peripheral clock enable register,                   Address offset: 0x40
    pub APB1ENR: u32,
    /// < RCC APB2 peripheral clock enable register,                   Address offset: 0x44
    pub APB2ENR: u32,
    /// < Reserved, 0x48-0x4C
    pub RESERVED3: [u32; 2usize],
    /// < RCC AHB1 peripheral clock enable in low power mode register, Address offset: 0x50
    pub AHB1LPENR: u32,
    /// < RCC AHB2 peripheral clock enable in low power mode register, Address offset: 0x54
    pub AHB2LPENR: u32,
    /// < RCC AHB3 peripheral clock enable in low power mode register, Address offset: 0x58
    pub AHB3LPENR: u32,
    /// < Reserved, 0x5C
    pub RESERVED4: u32,
    /// < RCC APB1 peripheral clock enable in low power mode register, Address offset: 0x60
    pub APB1LPENR: u32,
    /// < RCC APB2 peripheral clock enable in low power mode register, Address offset: 0x64
    pub APB2LPENR: u32,
    /// < Reserved, 0x68-0x6C
    pub RESERVED5: [u32; 2usize],
    /// < RCC Backup domain control register,                          Address offset: 0x70
    pub BDCR: u32,
    /// < RCC clock control & status register,                         Address offset: 0x74
    pub CSR: u32,
    /// < Reserved, 0x78-0x7C
    pub RESERVED6: [u32; 2usize],
    /// < RCC spread spectrum clock generation register,               Address offset: 0x80
    pub SSCGR: u32,
    /// < RCC PLLI2S configuration register,                           Address offset: 0x84
    pub PLLI2SCFGR: u32,
    /// < Reserved, 0x88
    pub RESERVED7: [u32; 1usize],
    /// < RCC Dedicated Clocks configuration register,                 Address offset: 0x8C
    pub DCKCFGR: u32,
}
#[test]
fn bindgen_test_layout_RCC_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<RCC_TypeDef>(),
        144usize,
        concat!("Size of: ", stringify!(RCC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<RCC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(RCC_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).CR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).PLLCFGR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(PLLCFGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).CFGR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(CFGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).CIR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(CIR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB1RSTR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB1RSTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB2RSTR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB2RSTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB3RSTR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB3RSTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED0 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB1RSTR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB1RSTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB2RSTR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB2RSTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED1 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB1ENR as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB1ENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB2ENR as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB2ENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB3ENR as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB3ENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED2 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB1ENR as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB1ENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB2ENR as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB2ENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED3 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB1LPENR as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB1LPENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB2LPENR as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB2LPENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).AHB3LPENR as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(AHB3LPENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED4 as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB1LPENR as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB1LPENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).APB2LPENR as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(APB2LPENR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED5 as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).BDCR as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(BDCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).CSR as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(CSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED6 as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).SSCGR as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(SSCGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).PLLI2SCFGR as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(PLLI2SCFGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).RESERVED7 as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(RESERVED7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RCC_TypeDef>())).DCKCFGR as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(RCC_TypeDef),
            "::",
            stringify!(DCKCFGR)
        )
    );
}
/// @brief Real-Time Clock
#[repr(C)]
pub struct RTC_TypeDef {
    /// < RTC time register,                                        Address offset: 0x00
    pub TR: u32,
    /// < RTC date register,                                        Address offset: 0x04
    pub DR: u32,
    /// < RTC control register,                                     Address offset: 0x08
    pub CR: u32,
    /// < RTC initialization and status register,                   Address offset: 0x0C
    pub ISR: u32,
    /// < RTC prescaler register,                                   Address offset: 0x10
    pub PRER: u32,
    /// < RTC wakeup timer register,                                Address offset: 0x14
    pub WUTR: u32,
    /// < RTC calibration register,                                 Address offset: 0x18
    pub CALIBR: u32,
    /// < RTC alarm A register,                                     Address offset: 0x1C
    pub ALRMAR: u32,
    /// < RTC alarm B register,                                     Address offset: 0x20
    pub ALRMBR: u32,
    /// < RTC write protection register,                            Address offset: 0x24
    pub WPR: u32,
    /// < RTC sub second register,                                  Address offset: 0x28
    pub SSR: u32,
    /// < RTC shift control register,                               Address offset: 0x2C
    pub SHIFTR: u32,
    /// < RTC time stamp time register,                             Address offset: 0x30
    pub TSTR: u32,
    /// < RTC time stamp date register,                             Address offset: 0x34
    pub TSDR: u32,
    /// < RTC time-stamp sub second register,                       Address offset: 0x38
    pub TSSSR: u32,
    /// < RTC calibration register,                                 Address offset: 0x3C
    pub CALR: u32,
    /// < RTC tamper and alternate function configuration register, Address offset: 0x40
    pub TAFCR: u32,
    /// < RTC alarm A sub second register,                          Address offset: 0x44
    pub ALRMASSR: u32,
    /// < RTC alarm B sub second register,                          Address offset: 0x48
    pub ALRMBSSR: u32,
    /// < Reserved, 0x4C
    pub RESERVED7: u32,
    /// < RTC backup register 1,                                    Address offset: 0x50
    pub BKP0R: u32,
    /// < RTC backup register 1,                                    Address offset: 0x54
    pub BKP1R: u32,
    /// < RTC backup register 2,                                    Address offset: 0x58
    pub BKP2R: u32,
    /// < RTC backup register 3,                                    Address offset: 0x5C
    pub BKP3R: u32,
    /// < RTC backup register 4,                                    Address offset: 0x60
    pub BKP4R: u32,
    /// < RTC backup register 5,                                    Address offset: 0x64
    pub BKP5R: u32,
    /// < RTC backup register 6,                                    Address offset: 0x68
    pub BKP6R: u32,
    /// < RTC backup register 7,                                    Address offset: 0x6C
    pub BKP7R: u32,
    /// < RTC backup register 8,                                    Address offset: 0x70
    pub BKP8R: u32,
    /// < RTC backup register 9,                                    Address offset: 0x74
    pub BKP9R: u32,
    /// < RTC backup register 10,                                   Address offset: 0x78
    pub BKP10R: u32,
    /// < RTC backup register 11,                                   Address offset: 0x7C
    pub BKP11R: u32,
    /// < RTC backup register 12,                                   Address offset: 0x80
    pub BKP12R: u32,
    /// < RTC backup register 13,                                   Address offset: 0x84
    pub BKP13R: u32,
    /// < RTC backup register 14,                                   Address offset: 0x88
    pub BKP14R: u32,
    /// < RTC backup register 15,                                   Address offset: 0x8C
    pub BKP15R: u32,
    /// < RTC backup register 16,                                   Address offset: 0x90
    pub BKP16R: u32,
    /// < RTC backup register 17,                                   Address offset: 0x94
    pub BKP17R: u32,
    /// < RTC backup register 18,                                   Address offset: 0x98
    pub BKP18R: u32,
    /// < RTC backup register 19,                                   Address offset: 0x9C
    pub BKP19R: u32,
}
#[test]
fn bindgen_test_layout_RTC_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<RTC_TypeDef>(),
        160usize,
        concat!("Size of: ", stringify!(RTC_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<RTC_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(RTC_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).TR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).DR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).CR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).ISR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ISR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).PRER as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(PRER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).WUTR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(WUTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).CALIBR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(CALIBR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).ALRMAR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).ALRMBR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMBR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).WPR as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(WPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).SSR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(SSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).SHIFTR as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(SHIFTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).TSTR as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TSTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).TSDR as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TSDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).TSSSR as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TSSSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).CALR as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(CALR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).TAFCR as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(TAFCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).ALRMASSR as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMASSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).ALRMBSSR as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(ALRMBSSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).RESERVED7 as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(RESERVED7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP0R as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP0R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP1R as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP1R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP2R as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP2R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP3R as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP3R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP4R as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP4R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP5R as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP5R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP6R as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP6R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP7R as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP7R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP8R as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP8R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP9R as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP9R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP10R as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP10R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP11R as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP11R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP12R as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP12R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP13R as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP13R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP14R as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP14R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP15R as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP15R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP16R as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP16R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP17R as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP17R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP18R as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP18R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<RTC_TypeDef>())).BKP19R as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(RTC_TypeDef),
            "::",
            stringify!(BKP19R)
        )
    );
}
/// @brief SD host Interface
#[repr(C)]
pub struct SDIO_TypeDef {
    /// < SDIO power control register,    Address offset: 0x00
    pub POWER: u32,
    /// < SDI clock control register,     Address offset: 0x04
    pub CLKCR: u32,
    /// < SDIO argument register,         Address offset: 0x08
    pub ARG: u32,
    /// < SDIO command register,          Address offset: 0x0C
    pub CMD: u32,
    /// < SDIO command response register, Address offset: 0x10
    pub RESPCMD: u32,
    /// < SDIO response 1 register,       Address offset: 0x14
    pub RESP1: u32,
    /// < SDIO response 2 register,       Address offset: 0x18
    pub RESP2: u32,
    /// < SDIO response 3 register,       Address offset: 0x1C
    pub RESP3: u32,
    /// < SDIO response 4 register,       Address offset: 0x20
    pub RESP4: u32,
    /// < SDIO data timer register,       Address offset: 0x24
    pub DTIMER: u32,
    /// < SDIO data length register,      Address offset: 0x28
    pub DLEN: u32,
    /// < SDIO data control register,     Address offset: 0x2C
    pub DCTRL: u32,
    /// < SDIO data counter register,     Address offset: 0x30
    pub DCOUNT: u32,
    /// < SDIO status register,           Address offset: 0x34
    pub STA: u32,
    /// < SDIO interrupt clear register,  Address offset: 0x38
    pub ICR: u32,
    /// < SDIO mask register,             Address offset: 0x3C
    pub MASK: u32,
    /// < Reserved, 0x40-0x44
    pub RESERVED0: [u32; 2usize],
    /// < SDIO FIFO counter register,     Address offset: 0x48
    pub FIFOCNT: u32,
    /// < Reserved, 0x4C-0x7C
    pub RESERVED1: [u32; 13usize],
    /// < SDIO data FIFO register,        Address offset: 0x80
    pub FIFO: u32,
}
#[test]
fn bindgen_test_layout_SDIO_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<SDIO_TypeDef>(),
        132usize,
        concat!("Size of: ", stringify!(SDIO_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<SDIO_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(SDIO_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).POWER as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(POWER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).CLKCR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(CLKCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).ARG as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(ARG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).CMD as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(CMD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).RESPCMD as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(RESPCMD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).RESP1 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(RESP1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).RESP2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(RESP2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).RESP3 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(RESP3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).RESP4 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(RESP4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).DTIMER as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(DTIMER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).DLEN as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(DLEN)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).DCTRL as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(DCTRL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).DCOUNT as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(DCOUNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).STA as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(STA)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).ICR as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(ICR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).MASK as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(MASK)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).RESERVED0 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(RESERVED0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).FIFOCNT as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(FIFOCNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).RESERVED1 as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(RESERVED1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDIO_TypeDef>())).FIFO as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(SDIO_TypeDef),
            "::",
            stringify!(FIFO)
        )
    );
}
/// @brief Serial Peripheral Interface
#[repr(C)]
pub struct SPI_TypeDef {
    /// < SPI control register 1 (not used in I2S mode),      Address offset: 0x00
    pub CR1: u32,
    /// < SPI control register 2,                             Address offset: 0x04
    pub CR2: u32,
    /// < SPI status register,                                Address offset: 0x08
    pub SR: u32,
    /// < SPI data register,                                  Address offset: 0x0C
    pub DR: u32,
    /// < SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10
    pub CRCPR: u32,
    /// < SPI RX CRC register (not used in I2S mode),         Address offset: 0x14
    pub RXCRCR: u32,
    /// < SPI TX CRC register (not used in I2S mode),         Address offset: 0x18
    pub TXCRCR: u32,
    /// < SPI_I2S configuration register,                     Address offset: 0x1C
    pub I2SCFGR: u32,
    /// < SPI_I2S prescaler register,                         Address offset: 0x20
    pub I2SPR: u32,
}
#[test]
fn bindgen_test_layout_SPI_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<SPI_TypeDef>(),
        36usize,
        concat!("Size of: ", stringify!(SPI_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<SPI_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(SPI_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).CR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).CR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).SR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).DR as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).CRCPR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(CRCPR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).RXCRCR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(RXCRCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).TXCRCR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(TXCRCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).I2SCFGR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(I2SCFGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SPI_TypeDef>())).I2SPR as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SPI_TypeDef),
            "::",
            stringify!(I2SPR)
        )
    );
}
/// @brief TIM
#[repr(C)]
pub struct TIM_TypeDef {
    /// < TIM control register 1,              Address offset: 0x00
    pub CR1: u32,
    /// < TIM control register 2,              Address offset: 0x04
    pub CR2: u32,
    /// < TIM slave mode control register,     Address offset: 0x08
    pub SMCR: u32,
    /// < TIM DMA/interrupt enable register,   Address offset: 0x0C
    pub DIER: u32,
    /// < TIM status register,                 Address offset: 0x10
    pub SR: u32,
    /// < TIM event generation register,       Address offset: 0x14
    pub EGR: u32,
    /// < TIM capture/compare mode register 1, Address offset: 0x18
    pub CCMR1: u32,
    /// < TIM capture/compare mode register 2, Address offset: 0x1C
    pub CCMR2: u32,
    /// < TIM capture/compare enable register, Address offset: 0x20
    pub CCER: u32,
    /// < TIM counter register,                Address offset: 0x24
    pub CNT: u32,
    /// < TIM prescaler,                       Address offset: 0x28
    pub PSC: u32,
    /// < TIM auto-reload register,            Address offset: 0x2C
    pub ARR: u32,
    /// < TIM repetition counter register,     Address offset: 0x30
    pub RCR: u32,
    /// < TIM capture/compare register 1,      Address offset: 0x34
    pub CCR1: u32,
    /// < TIM capture/compare register 2,      Address offset: 0x38
    pub CCR2: u32,
    /// < TIM capture/compare register 3,      Address offset: 0x3C
    pub CCR3: u32,
    /// < TIM capture/compare register 4,      Address offset: 0x40
    pub CCR4: u32,
    /// < TIM break and dead-time register,    Address offset: 0x44
    pub BDTR: u32,
    /// < TIM DMA control register,            Address offset: 0x48
    pub DCR: u32,
    /// < TIM DMA address for full transfer,   Address offset: 0x4C
    pub DMAR: u32,
    /// < TIM option register,                 Address offset: 0x50
    pub OR: u32,
}
#[test]
fn bindgen_test_layout_TIM_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<TIM_TypeDef>(),
        84usize,
        concat!("Size of: ", stringify!(TIM_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<TIM_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(TIM_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CR1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CR2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).SMCR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(SMCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).DIER as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(DIER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).SR as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).EGR as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(EGR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCMR1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCMR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCMR2 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCMR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCER as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCER)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CNT as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CNT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).PSC as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(PSC)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).ARR as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(ARR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).RCR as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(RCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCR1 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCR2 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCR3 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).CCR4 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(CCR4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).BDTR as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(BDTR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).DCR as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(DCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).DMAR as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(DMAR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TIM_TypeDef>())).OR as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(TIM_TypeDef),
            "::",
            stringify!(OR)
        )
    );
}
/// @brief Universal Synchronous Asynchronous Receiver Transmitter
#[repr(C)]
pub struct USART_TypeDef {
    /// < USART Status register,                   Address offset: 0x00
    pub SR: u32,
    /// < USART Data register,                     Address offset: 0x04
    pub DR: u32,
    /// < USART Baud rate register,                Address offset: 0x08
    pub BRR: u32,
    /// < USART Control register 1,                Address offset: 0x0C
    pub CR1: u32,
    /// < USART Control register 2,                Address offset: 0x10
    pub CR2: u32,
    /// < USART Control register 3,                Address offset: 0x14
    pub CR3: u32,
    /// < USART Guard time and prescaler register, Address offset: 0x18
    pub GTPR: u32,
}
#[test]
fn bindgen_test_layout_USART_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USART_TypeDef>(),
        28usize,
        concat!("Size of: ", stringify!(USART_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USART_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USART_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).SR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(SR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).DR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(DR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).BRR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(BRR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).CR1 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(CR1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).CR2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(CR2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).CR3 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(CR3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USART_TypeDef>())).GTPR as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USART_TypeDef),
            "::",
            stringify!(GTPR)
        )
    );
}
/// @brief Window WATCHDOG
#[repr(C)]
pub struct WWDG_TypeDef {
    /// < WWDG Control register,       Address offset: 0x00
    pub CR: u32,
    /// < WWDG Configuration register, Address offset: 0x04
    pub CFR: u32,
    /// < WWDG Status register,        Address offset: 0x08
    pub SR: u32,
}
#[test]
fn bindgen_test_layout_WWDG_TypeDef() {
    assert_eq!(
        ::core::mem::size_of::<WWDG_TypeDef>(),
        12usize,
        concat!("Size of: ", stringify!(WWDG_TypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<WWDG_TypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(WWDG_TypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WWDG_TypeDef>())).CR as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WWDG_TypeDef),
            "::",
            stringify!(CR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WWDG_TypeDef>())).CFR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WWDG_TypeDef),
            "::",
            stringify!(CFR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<WWDG_TypeDef>())).SR as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WWDG_TypeDef),
            "::",
            stringify!(SR)
        )
    );
}
/// @brief USB_OTG_Core_Registers
#[repr(C)]
pub struct USB_OTG_GlobalTypeDef {
    /// < USB_OTG Control and Status Register          000h
    pub GOTGCTL: u32,
    /// < USB_OTG Interrupt Register                   004h
    pub GOTGINT: u32,
    /// < Core AHB Configuration Register              008h
    pub GAHBCFG: u32,
    /// < Core USB Configuration Register              00Ch
    pub GUSBCFG: u32,
    /// < Core Reset Register                          010h
    pub GRSTCTL: u32,
    /// < Core Interrupt Register                      014h
    pub GINTSTS: u32,
    /// < Core Interrupt Mask Register                 018h
    pub GINTMSK: u32,
    /// < Receive Sts Q Read Register                  01Ch
    pub GRXSTSR: u32,
    /// < Receive Sts Q Read & POP Register            020h
    pub GRXSTSP: u32,
    /// < Receive FIFO Size Register                   024h
    pub GRXFSIZ: u32,
    /// < EP0 / Non Periodic Tx FIFO Size Register     028h
    pub DIEPTXF0_HNPTXFSIZ: u32,
    /// < Non Periodic Tx FIFO/Queue Sts reg           02Ch
    pub HNPTXSTS: u32,
    /// < Reserved                                     030h
    pub Reserved30: [u32; 2usize],
    /// < General Purpose IO Register                  038h
    pub GCCFG: u32,
    /// < User ID Register                             03Ch
    pub CID: u32,
    /// < Reserved                                0x40-0xFF
    pub Reserved40: [u32; 48usize],
    /// < Host Periodic Tx FIFO Size Reg               100h
    pub HPTXFSIZ: u32,
    /// < dev Periodic Transmit FIFO
    pub DIEPTXF: [u32; 15usize],
}
#[test]
fn bindgen_test_layout_USB_OTG_GlobalTypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_GlobalTypeDef>(),
        320usize,
        concat!("Size of: ", stringify!(USB_OTG_GlobalTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_GlobalTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_GlobalTypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GOTGCTL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GOTGCTL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GOTGINT as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GOTGINT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GAHBCFG as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GAHBCFG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GUSBCFG as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GUSBCFG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GRSTCTL as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRSTCTL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GINTSTS as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GINTSTS)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GINTMSK as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GINTMSK)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GRXSTSR as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRXSTSR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GRXSTSP as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRXSTSP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GRXFSIZ as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GRXFSIZ)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).DIEPTXF0_HNPTXFSIZ as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(DIEPTXF0_HNPTXFSIZ)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).HNPTXSTS as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(HNPTXSTS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).Reserved30 as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(Reserved30)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).GCCFG as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(GCCFG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).CID as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(CID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).Reserved40 as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(Reserved40)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).HPTXFSIZ as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(HPTXFSIZ)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_GlobalTypeDef>())).DIEPTXF as *const _ as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_GlobalTypeDef),
            "::",
            stringify!(DIEPTXF)
        )
    );
}
/// @brief USB_OTG_device_Registers
#[repr(C)]
pub struct USB_OTG_DeviceTypeDef {
    /// < dev Configuration Register   800h
    pub DCFG: u32,
    /// < dev Control Register         804h
    pub DCTL: u32,
    /// < dev Status Register (RO)     808h
    pub DSTS: u32,
    /// < Reserved                     80Ch
    pub Reserved0C: u32,
    /// < dev IN Endpoint Mask         810h
    pub DIEPMSK: u32,
    /// < dev OUT Endpoint Mask        814h
    pub DOEPMSK: u32,
    /// < dev All Endpoints Itr Reg    818h
    pub DAINT: u32,
    /// < dev All Endpoints Itr Mask   81Ch
    pub DAINTMSK: u32,
    /// < Reserved                     820h
    pub Reserved20: u32,
    /// < Reserved                     824h
    pub Reserved9: u32,
    /// < dev VBUS discharge Register  828h
    pub DVBUSDIS: u32,
    /// < dev VBUS Pulse Register      82Ch
    pub DVBUSPULSE: u32,
    /// < dev threshold                830h
    pub DTHRCTL: u32,
    /// < dev empty msk                834h
    pub DIEPEMPMSK: u32,
    /// < dedicated EP interrupt       838h
    pub DEACHINT: u32,
    /// < dedicated EP msk             83Ch
    pub DEACHMSK: u32,
    /// < dedicated EP mask            840h
    pub Reserved40: u32,
    /// < dedicated EP mask            844h
    pub DINEP1MSK: u32,
    /// < Reserved                 844-87Ch
    pub Reserved44: [u32; 15usize],
    /// < dedicated EP msk             884h
    pub DOUTEP1MSK: u32,
}
#[test]
fn bindgen_test_layout_USB_OTG_DeviceTypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_DeviceTypeDef>(),
        136usize,
        concat!("Size of: ", stringify!(USB_OTG_DeviceTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_DeviceTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_DeviceTypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DCFG as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DCFG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DCTL as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DCTL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DSTS as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DSTS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).Reserved0C as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(Reserved0C)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DIEPMSK as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DIEPMSK)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DOEPMSK as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DOEPMSK)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DAINT as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DAINT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DAINTMSK as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DAINTMSK)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).Reserved20 as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(Reserved20)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).Reserved9 as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(Reserved9)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DVBUSDIS as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DVBUSDIS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DVBUSPULSE as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DVBUSPULSE)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DTHRCTL as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DTHRCTL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DIEPEMPMSK as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DIEPEMPMSK)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DEACHINT as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DEACHINT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DEACHMSK as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DEACHMSK)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).Reserved40 as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(Reserved40)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DINEP1MSK as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DINEP1MSK)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).Reserved44 as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(Reserved44)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_DeviceTypeDef>())).DOUTEP1MSK as *const _ as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_DeviceTypeDef),
            "::",
            stringify!(DOUTEP1MSK)
        )
    );
}
/// @brief USB_OTG_IN_Endpoint-Specific_Register
#[repr(C)]
pub struct USB_OTG_INEndpointTypeDef {
    /// < dev IN Endpoint Control Reg    900h + (ep_num * 20h) + 00h
    pub DIEPCTL: u32,
    /// < Reserved                       900h + (ep_num * 20h) + 04h
    pub Reserved04: u32,
    /// < dev IN Endpoint Itr Reg        900h + (ep_num * 20h) + 08h
    pub DIEPINT: u32,
    /// < Reserved                       900h + (ep_num * 20h) + 0Ch
    pub Reserved0C: u32,
    /// < IN Endpoint Txfer Size         900h + (ep_num * 20h) + 10h
    pub DIEPTSIZ: u32,
    /// < IN Endpoint DMA Address Reg    900h + (ep_num * 20h) + 14h
    pub DIEPDMA: u32,
    /// < IN Endpoint Tx FIFO Status Reg 900h + (ep_num * 20h) + 18h
    pub DTXFSTS: u32,
    /// < Reserved  900h+(ep_num*20h)+1Ch-900h+ (ep_num * 20h) + 1Ch
    pub Reserved18: u32,
}
#[test]
fn bindgen_test_layout_USB_OTG_INEndpointTypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_INEndpointTypeDef>(),
        32usize,
        concat!("Size of: ", stringify!(USB_OTG_INEndpointTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_INEndpointTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_INEndpointTypeDef))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).DIEPCTL as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(DIEPCTL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).Reserved04 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(Reserved04)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).DIEPINT as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(DIEPINT)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).Reserved0C as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(Reserved0C)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).DIEPTSIZ as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(DIEPTSIZ)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).DIEPDMA as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(DIEPDMA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).DTXFSTS as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(DTXFSTS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_INEndpointTypeDef>())).Reserved18 as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_INEndpointTypeDef),
            "::",
            stringify!(Reserved18)
        )
    );
}
/// @brief USB_OTG_OUT_Endpoint-Specific_Registers
#[repr(C)]
pub struct USB_OTG_OUTEndpointTypeDef {
    /// < dev OUT Endpoint Control Reg           B00h + (ep_num * 20h) + 00h
    pub DOEPCTL: u32,
    /// < Reserved                               B00h + (ep_num * 20h) + 04h
    pub Reserved04: u32,
    /// < dev OUT Endpoint Itr Reg               B00h + (ep_num * 20h) + 08h
    pub DOEPINT: u32,
    /// < Reserved                               B00h + (ep_num * 20h) + 0Ch
    pub Reserved0C: u32,
    /// < dev OUT Endpoint Txfer Size            B00h + (ep_num * 20h) + 10h
    pub DOEPTSIZ: u32,
    /// < dev OUT Endpoint DMA Address           B00h + (ep_num * 20h) + 14h
    pub DOEPDMA: u32,
    /// < Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch
    pub Reserved18: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_USB_OTG_OUTEndpointTypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_OUTEndpointTypeDef>(),
        32usize,
        concat!("Size of: ", stringify!(USB_OTG_OUTEndpointTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_OUTEndpointTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_OUTEndpointTypeDef))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).DOEPCTL as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_OUTEndpointTypeDef),
            "::",
            stringify!(DOEPCTL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).Reserved04 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_OUTEndpointTypeDef),
            "::",
            stringify!(Reserved04)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).DOEPINT as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_OUTEndpointTypeDef),
            "::",
            stringify!(DOEPINT)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).Reserved0C as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_OUTEndpointTypeDef),
            "::",
            stringify!(Reserved0C)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).DOEPTSIZ as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_OUTEndpointTypeDef),
            "::",
            stringify!(DOEPTSIZ)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).DOEPDMA as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_OUTEndpointTypeDef),
            "::",
            stringify!(DOEPDMA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_OUTEndpointTypeDef>())).Reserved18 as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_OUTEndpointTypeDef),
            "::",
            stringify!(Reserved18)
        )
    );
}
/// @brief USB_OTG_Host_Mode_Register_Structures
#[repr(C)]
pub struct USB_OTG_HostTypeDef {
    /// < Host Configuration Register          400h
    pub HCFG: u32,
    /// < Host Frame Interval Register         404h
    pub HFIR: u32,
    /// < Host Frame Nbr/Frame Remaining       408h
    pub HFNUM: u32,
    /// < Reserved                             40Ch
    pub Reserved40C: u32,
    /// < Host Periodic Tx FIFO/ Queue Status  410h
    pub HPTXSTS: u32,
    /// < Host All Channels Interrupt Register 414h
    pub HAINT: u32,
    /// < Host All Channels Interrupt Mask     418h
    pub HAINTMSK: u32,
}
#[test]
fn bindgen_test_layout_USB_OTG_HostTypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_HostTypeDef>(),
        28usize,
        concat!("Size of: ", stringify!(USB_OTG_HostTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_HostTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_HostTypeDef))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_HostTypeDef>())).HCFG as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostTypeDef),
            "::",
            stringify!(HCFG)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_HostTypeDef>())).HFIR as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostTypeDef),
            "::",
            stringify!(HFIR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_HostTypeDef>())).HFNUM as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostTypeDef),
            "::",
            stringify!(HFNUM)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_HostTypeDef>())).Reserved40C as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostTypeDef),
            "::",
            stringify!(Reserved40C)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_HostTypeDef>())).HPTXSTS as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostTypeDef),
            "::",
            stringify!(HPTXSTS)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_HostTypeDef>())).HAINT as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostTypeDef),
            "::",
            stringify!(HAINT)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<USB_OTG_HostTypeDef>())).HAINTMSK as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostTypeDef),
            "::",
            stringify!(HAINTMSK)
        )
    );
}
/// @brief USB_OTG_Host_Channel_Specific_Registers
#[repr(C)]
pub struct USB_OTG_HostChannelTypeDef {
    /// < Host Channel Characteristics Register    500h
    pub HCCHAR: u32,
    /// < Host Channel Split Control Register      504h
    pub HCSPLT: u32,
    /// < Host Channel Interrupt Register          508h
    pub HCINT: u32,
    /// < Host Channel Interrupt Mask Register     50Ch
    pub HCINTMSK: u32,
    /// < Host Channel Transfer Size Register      510h
    pub HCTSIZ: u32,
    /// < Host Channel DMA Address Register        514h
    pub HCDMA: u32,
    /// < Reserved
    pub Reserved: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_USB_OTG_HostChannelTypeDef() {
    assert_eq!(
        ::core::mem::size_of::<USB_OTG_HostChannelTypeDef>(),
        32usize,
        concat!("Size of: ", stringify!(USB_OTG_HostChannelTypeDef))
    );
    assert_eq!(
        ::core::mem::align_of::<USB_OTG_HostChannelTypeDef>(),
        4usize,
        concat!("Alignment of ", stringify!(USB_OTG_HostChannelTypeDef))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_HostChannelTypeDef>())).HCCHAR as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostChannelTypeDef),
            "::",
            stringify!(HCCHAR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_HostChannelTypeDef>())).HCSPLT as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostChannelTypeDef),
            "::",
            stringify!(HCSPLT)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_HostChannelTypeDef>())).HCINT as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostChannelTypeDef),
            "::",
            stringify!(HCINT)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_HostChannelTypeDef>())).HCINTMSK as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostChannelTypeDef),
            "::",
            stringify!(HCINTMSK)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_HostChannelTypeDef>())).HCTSIZ as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostChannelTypeDef),
            "::",
            stringify!(HCTSIZ)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_HostChannelTypeDef>())).HCDMA as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostChannelTypeDef),
            "::",
            stringify!(HCDMA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<USB_OTG_HostChannelTypeDef>())).Reserved as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(USB_OTG_HostChannelTypeDef),
            "::",
            stringify!(Reserved)
        )
    );
}
